# Accounts Receivables List

In this short project, I will produce an accounts receivables lists, containing the customer name and it's current obligation, by retreiving information from 4 separate tables.

First let's connect to SQL and to the database

In [1]:
%load_ext sql

In [2]:
%sql mysql://root:Ekonomiks1983@localhost/ar_sv

In [3]:
%sql SHOW TABLES;

 * mysql://root:***@localhost/ar_sv
5 rows affected.

[('customers_al',),
 ('customers_ks',),
 ('init_balances',),
 ('invoices',),
 ('payments',)]

So, we are given dhe above tables, which contain information as below:
1. customers_al and customers_ks, basic customer information, for two separate countries.
2. init_balances, a list of customer which had a balance (obligation or credit) at the begining of the year and their balance.
3. invoices, a list of all invoices.
4. payments, a list of all payments

Let's take a closer look at the columns of each table, by showing a single row of their data.

In [6]:
%sql SELECT * FROM customers_al LIMIT 1;

 * mysql://root:***@localhost/ar_sv
1 rows affected.

[('411325', '2 - NAIM GRIPSHI SH.P.K', '')]

In [7]:
%sql SELECT * FROM customers_ks LIMIT 1;

 * mysql://root:***@localhost/ar_sv
1 rows affected.

[('4111105ks', '" Blue Pearl "  SH.P.K.', 'p.n.')]

In [9]:
%sql SELECT * FROM init_balances LIMIT 1;

 * mysql://root:***@localhost/ar_sv
1 rows affected.

[('411528', '01.01.2022', 'Gj. Fillestare 01.01.2022', -114.12)]

In [10]:
%sql SELECT * FROM invoices LIMIT 1;

 * mysql://root:***@localhost/ar_sv
1 rows affected.

[('411074', '03.01.2022', 3, 59.25)]

In [12]:
%sql SELECT * FROM payments LIMIT 1;

 * mysql://root:***@localhost/ar_sv
1 rows affected.

[('4111143ks', '03.01.2022', 'Pagese', 122.0, 'none')]

Now let's build a query that retrieves information from these tables, producing a list containing the customer name and it's current obligation, first for table customers_al, than for table customers_ks. The difficult part for me was the need of a GROUP BY clause, before joining invoices and payments with the customers_al table.

In [30]:
%%sql SELECT LPAD(RIGHT(Cust_Name,5),10,'XXXX') AS Customer,
	ROUND((IFNULL(Faturat,0) + IFNULL(Amount_EUR,0) - IFNULL(Pagesat,0)),2) AS Obligation
FROM customers_al ca
LEFT JOIN (SELECT CustID, SUM(inv_amt) AS Faturat FROM invoices GROUP BY CustID) AS i 
	ON ca.CustID = i.CustID
LEFT JOIN (SELECT CustID, SUM(payment_amt) AS Pagesat FROM payments GROUP BY CustID) AS p 
	ON ca.CustID = p.CustID
LEFT JOIN init_balances ib 
	ON ca.CustID = ib.CustID
GROUP BY Cust_Name
HAVING Obligation != 0
LIMIT 5
;

 * mysql://root:***@localhost/ar_sv
5 rows affected.

[('XXXXXGOLLI', 59.1),
 ('XXXXXmit )', 93.84),
 ('XXXXXVLORE', 17.7),
 ('XXXXXHARKU', 157.4),
 ('XXXXXSTEZO', 1490.32)]

Now the same for the customers_ks table

In [32]:
%%sql SELECT LPAD(RIGHT(Cust_Name,5),10,'XXXX') AS Customer,
	ROUND((IFNULL(Faturat,0) + IFNULL(Amount_EUR,0) - IFNULL(Pagesat,0)),2) AS Obligation
FROM customers_ks ck
LEFT JOIN (SELECT CustID, SUM(inv_amt) AS Faturat FROM invoices GROUP BY CustID) AS i 
	ON ck.CustID = i.CustID
LEFT JOIN (SELECT CustID, SUM(payment_amt) AS Pagesat FROM payments GROUP BY CustID) AS p 
	ON ck.CustID = p.CustID
LEFT JOIN init_balances ib 
	ON ck.CustID = ib.CustID
GROUP BY Cust_Name
HAVING Obligation != 0
LIMIT 5
;

 * mysql://root:***@localhost/ar_sv
5 rows affected.

[('XXXXXgova)', 69.0),
 ('XXXXXOTI )', 87.0),
 ('XXXXXroll)', 47.5),
 ('XXXXXHTRRI', 78.0),
 ('XXXXXYTYQI', 138.0)]